app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
---
  def index
    if params[:artist_id] != nil
      @artist = Artist.find_by(id: params[:artist_id])
       if  @artist == nil
         flash[:message] = "Artist not found."
         redirect_to artists_path
       else
         @songs = @artist.songs
       end
   else
     @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]
---
  def show
    #SongsController GET show with  artist redirects to artists songs when artist song not found

   if params[:artist_id] != nil
     @artist = Artist.find_by(id: params[:artist_id])
     if Song.find_by(id: params[:id]) == nil